// Напишите функцию diff, которая принимает два угла (integer), каждый от 0 до 360, и возвращает наименьшую разницу между ними.
//
//     Примеры:
//
// diff(0, 45) === 45;         // не 315, а 45, потому что 45 меньше
// diff(0, 180) === 180;
// diff(0, 190) === 170;       // не 190, а 170, потому что 170 меньше
// diff(120, 280) === 160;


const diff = (a, b) => {
    return (Math.abs(a - b) > 180) ? 360 - Math.abs(a - b) : Math.abs(a - b)
};

console.log(diff(0, 45)); // 45
console.log(diff(0, 180)); // 180
console.log(diff(0, 190)); // 170
console.log(diff(120, 280)); // 160
console.log(diff(160, 20)); // 140
console.log(diff(200, 2)); // 162